{"data":{"markdownRemark":{"html":"<p>Over the last couple of days, I’ve been setting up my Macbook Air to dual boot into <a href=\"http://www.ubuntu.com/\">Ubuntu</a> for development. Why do that, when OS X is perfectly fine for Ruby / Rails development? Because I’m a nerd. There’s also the fringe benefit of working on a similar development environment as your production environment… Because if you’re using, say, <a href=\"https://www.digitalocean.com/\">Digital Ocean</a>, they give you the option of running Ubuntu Server for your production environment. So there’s that. For those unfamiliar, Ubuntu is a very popular, user-friendly distribution of Linux. I chose to install Ubuntu over <a href=\"https://www.debian.org/\">Debian</a> or <a href=\"http://fedoraproject.org/\">Fedora</a> because I didn’t want to fuss around <em>too</em> much with configurations, but feel free to choose whichever distro you like. I’m not going to go into installing Ubuntu on your computer; depending on your need, you could do something as simple as allowing Ubuntu to automate that process via its live install process to something more involved like setting up your own partitions and using <a href=\"http://www.rodsbooks.com/refind/\">rEFInd</a> to dual boot (I did the latter). In fact, I won’t even be going into my whole setup. Why do that, when it’s documented perfectly well in my GitHub Dotfiles? Check them out: <a href=\"https://github.com/dstrunk/dotfiles\">dstrunk Dotfiles</a> I suppose I <em>could</em> touch on the particulars a bit. See, up until recently, I was using forks of other peoples’ dotfiles, which resulted in a <strong>ton</strong> of really cool terminal configurations that <em>I never really used</em>. My development environment was also a bit messy, often installing things ad-hoc. Instead of going that route for my new partition, I decided to write everything “from scratch”; borrowing from other dotfiles, but never copying directly. There’s a ton of influence from <a href=\"https://github.com/thoughtbot/dotfiles\">Thoughtbot’s dotfiles</a>, and some from <a href=\"https://github.com/mathiasbynens/dotfiles/\">Mathias Bynen’s</a>, but mostly my focus was on only adding things if I used them regularly. Hence a tiny repository containing only Vim and <code class=\"language-text\">bash</code> configurations. Here’s a quick summary:</p>\n<ul>\n<li>Install Homebrew, rbenv, and any databases that need installing (usually Mysql / Postgresql).</li>\n<li>Symlink <code class=\"language-text\">.vim</code>, <code class=\"language-text\">.vimrc</code>, <code class=\"language-text\">.vimrc.bundles</code>, and <code class=\"language-text\">.bash_profile</code> into the home directory.</li>\n<li>Open up Vim and run <code class=\"language-text\">:PluginInstall</code>.</li>\n</ul>\n<p>As stated in the dotfiles under <strong>Future plans</strong>, I’d eventually like to streamline this processes to decouple my setup from totally overwriting system files. However, even without that, I’m more inclined to this method over, say, using <a href=\"http://robots.thoughtbot.com/rcm-for-rc-files-in-dotfiles-repos\">Thoughtbot’s rc file manager</a>. While Thoughtbot’s way of automatically setting up your system is nice (and I especially understand when it comes to setting up multiple computers for a mid-sized business where environments must be similar), I rather enjoy manually setting up my system and understanding the <em>why</em> behind the <em>what</em>.</p>","frontmatter":{"title":"Nerding out: setting up Ubuntu for Ruby development","date":null}}},"pageContext":{"slug":"nerding-out-setting-up-ubuntu-for-ruby-development","type":"blog"}}