{"data":{"markdownRemark":{"html":"<p>I’m working on an updated version of our company’s online styleguide at work, and wanted to modernize it by introducing <a href=\"//bower.io/\">Bower</a> and <a href=\"//gulpjs.com\">Gulp</a> into the build process. This will make it easier to update and share with other developers as our team grows.</p>\n<p>Early in the process, I ran into a problem: I wanted to include <a href=\"necolas.github.com/normalize.css/\">normalize.css</a> via bower, then include that in the Sass stylesheet. The issue with this is, normalize is a CSS file. Including this file in Sass results in a CSS <code class=\"language-text\">@import &#39;normalize.css&#39;</code> at compile time, which is not a best practice in most cases*. We need the file to end with <code class=\"language-text\">.scss</code> or <code class=\"language-text\">.sass</code> to properly integrate it with our other Sass files.</p>\n<p>After looking around a bit, I found a rather large <a href=\"https://github.com/sass/sass/issues/556\">GitHub issue</a>, opened in October 2012, that is still pretty much unresolved. There are dozens of comments in the issue from people in similar situations as mine—using bower to import assets but not wanting the curent behavior.</p>\n<p>Since the issue is now going on 3 years without any official fix, there were a couple of commenters showing how they approached a fix. I liked one of them, and now here it is!</p>\n<h2>The fix</h2>\n<p>Say you’re installing normalize.css like me. If you install via bower, the file will returned will be <code class=\"language-text\">normalize.css</code>. In order to add this asset to your sass file and have it compile correctly, you’ll need the final file to be called <code class=\"language-text\">_normalize.scss</code>.</p>\n<p>Knowing this, let’s start. You’ll need to create a <code class=\"language-text\">.bowerrc</code> file to configure Bower. Add this to the file:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">{\n    &quot;scripts&quot;: {\n        &quot;postinstall&quot;: &quot;./.bower-postinstall&quot;\n    }\n}</code></pre></div>\n<p>Now, let’s create the shell script <code class=\"language-text\">.bower-postinstall</code> referenced in the <code class=\"language-text\">.bowerrc</code>:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">#!/bin/sh\n\nif [ -f &quot;bower_components/normalize.css/normalize.css&quot; ]; then\n\tmv bower_components/normalize.css/normalize.css bower_components/normalize.css/_normalize.scss\nfi</code></pre></div>\n<p>The <code class=\"language-text\">if</code> statement is just for peace of mind so future bower installs don’t make bower complain of <code class=\"language-text\">no such file or directory</code>. One last thing—we’ll need to make sure this script is executable. In terminal, type <code class=\"language-text\">chmod a+x .bower-postinstall</code>.</p>\n<p>Now, install normalize.css through bower as usual:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">bower install normalize.css</code></pre></div>\n<p>If everything worked out, you should be able to browse to <em>bower_components > normalize.css</em> and see <code class=\"language-text\">_normalize.scss</code> in place of the normal <code class=\"language-text\">normalize.css</code> file.</p>\n<p>There are pros and cons to this approach. The good: you should be able to upgrade via bower with no problems as usual. The bad? This approach assumes knowledge of the folder structure of whatever component you’re installing. This doesn’t seem like a huge deal with one or two components, but if you have a lot of modules and / or the folder structure / file name on any of those modules changes, you’ll have to deal with those in the <code class=\"language-text\">.bower-postinstall</code> script. This isn’t normally a problem, but it’s something to watch out for.</p>\n<p>Hope that helps anyone in a similar position!</p>\n<p><small>*Occasionally you might see imports used in something like media queries, for instance, but it’s usually a bad idea. CSS imports don’t download concurrently, so if you <strong>really</strong> need to use an import, you might just want to stick to using two <code class=\"language-text\">link</code> tags instead.</small></p>","frontmatter":{"title":"Changing CSS to Sass in Bower dependencies","date":null}}},"pageContext":{"slug":"changing-css-to-sass-in-bower-dependencies","blogpath":"blog/2015/changing-css-to-sass-in-bower-dependencies","type":"blog","jekyllDate":"2015-03-11"}}