{"data":{"markdownRemark":{"html":"<blockquote>\n<p><a href=\"http://www.shopify.com/technology/15646068-rebuilding-the-shopify-admin-improving-developer-productivity-by-deleting-28-000-lines-of-javascript\">Rebuilding the Shopify Admin: Improving Developer Productivity by Deleting 28,000 Lines of Javascript</a></p>\n</blockquote>\n<p><strong>The TL;DR:</strong> Shopify created an internal JavaScript framework. This framework became unweildy, it became difficult to train new members of the team, and Shopify was forced to migrate back to a more traditional setup.</p>\n<p>The above link speaks to me in so many ways.</p>\n<p>While reading the article so many things made me want to pull out my hair. First was the creation of the internal framework in the first place. My contention is this: why, with so many <a href=\"http://backbonejs.org/\">solid</a>, <a href=\"http://emberjs.com/\">battle-tested</a> <a href=\"http://angularjs.org/\">frameworks</a>, is Shopify trying to reinvent the wheel in the first place? Furthermore, why, after finding that their internal framework didn’t work out, would they go back and do it again?!</p>\n<h3>Technical debt</h3>\n<p>Aside from those little quibbles, the actual message of the article is pretty good. Technical debt is a Big Thing™. If management can’t be concerned with fixing technical debt, it would be good to make them aware of the problems associated. Technical debt:</p>\n<ul>\n<li>Makes it harder to train new employees on said application</li>\n<li>Makes new features difficult to add</li>\n<li>Makes the app difficult to maintain</li>\n<li>Slows down development</li>\n<li>Usually has performance hits due to poor design choices</li>\n</ul>\n<p>And those are just the cost-associated reasons to fix tech debt. Psychologically, technical debt can be draining. Imagine coming in to work everyday and working on a slow, unmaintainable, terribly-built application. It wouldn’t be a big leap to imagine a company in this position having a high turnover rate and low morale. In short, technical debt is bad and you should fix it as soon as possible.</p>","frontmatter":{"title":"Technical debt must be paid","date":null}}},"pageContext":{"slug":"technical-debt-must-be-paid","blogpath":"blog/2014/technical-debt-must-be-paid","type":"blog","jekyllDate":"2014-10-30"}}