{"data":{"markdownRemark":{"html":"<p>Hiya! Hope your week’s treated you well. I received the MEAP version 13 of <em>Rails 4 in Action</em> on Monday night. It’s very well-written (despite some grammatical errors that I’m sure will be taken care of in the final version), and I’m antsy for the authors to complete it so I can receive my hard copy! I got to working on the newest completed chapter. Needless to say, jumping back into the codebase after a month off felt like this: <img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083569/Z9rfG_lpcm5c.gif\" alt=\"I have no memory of this place\"> After the initial “wtf is all this” feeling wore off, I knocked out the new chapter pretty quickly. I’ll write a full review of <em>Rails 4 in Action</em> in the future (there’s a pretty comprehensive review in my drafts now; I’m just waiting for the final book), but I’ll share my initial opinionated impressions here: I like this book’s approach to Rails dev <strong>a whole lot more</strong> than the Ruby on Rails tutorial by Hartl. Git commits are quicker, tests are a bit more basic (and are truly focused on writing a failing test before generating models, controllers, etc), and the overall writing style is easier for me to understand. That’s not to take anything away from Hartl—I’m going through his tutorial in tandem, and it’s very well done! It’s just, well, different strokes and all that. I’ve been continuing my work on building the development site I talked about last week. I’m playing with extending layouts a bit more via YAML and Liquid (to a newbie it sounds a lot harder than it actually is). So, for instance, my about page has this additional information in the YAML front matter block:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">---\nlayout: about\ntitle: about\n\nprofile_img: /images/profile.png\nprofile_name: Daniel Strunk\nprofile_title: Developer\nprofile_email: daniel@silentpost.io\nprofile_twitter: dstrunk\nprofile_fb: silentpost\nprofile_instagram: silentpost\nprofile_github: silentpost\n---</code></pre></div>\n<p> From there, I can dynamically insert all of those values with Liquid, and let Jekyll take care of compiling the correct information:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;div class=&quot;about&quot;&gt;\n\t  &lt;img alt=&quot;{{ page.profile_name }}&quot; src=&quot;{{ page.profile_img }}&quot; /&gt;\n\t  {{ page.profile_name }}\n\t  {{ page.profile_title }}, Silentpost\n\t  ...</code></pre></div>\n<p>That’s an extremely simple example of what Jekyll can do. As you can see, <strong>very</strong> simple stuff, but it’s really turning me on to the Jekyll ecosystem. I haven’t even touched the cool parts yet—things like what it can do with categories and tags. Jekyll’s smart enough to group similarly named categories and tags together, and build a site based on that category structure for you. That’s a terrible explanation, so I’d recommend <a href=\"http://jekyllrb.com/docs/frontmatter/\">checking out the docs</a>. Until next week!</p>","frontmatter":{"title":"Captain's log, week 5","date":null}}},"pageContext":{"slug":"captains-log-week-5","blogpath":"blog/2014/captains-log-week-5","type":"blog","jekyllDate":"2014-02-21"}}