{"data":{"markdownRemark":{"html":"<p>It looks like “Learn to Code” bootcamps are coming under fire in California. Unless the programs comply with CA regulations regarding post-secondary education, they face a hefty $50,000 fine and closure. The bootcamps have two weeks to start coming into compliance. I think these programs are a fantastic alternative to a Computer Science degree for learning programming. A problem many traditional schools face with an ever-changing industry such as computer programming is an almost-immediately outdated curriculum. Learn to code bootcamps provide a more direct method to learning to program, provided by industry leaders and in a shorter timeframe. They are often touted as fantastic ways to quickly become marketable in <em>x-language-of-choice</em>, with graduates landing coveted jobs in top companies. And they might be—I’ve heard nothing but good things from many of the more famous ones (<a href=\"http://www.thisismetis.com/\" title=\"Metis\">Metis</a>, <a href=\"http://theironyard.com/\" title=\"The Iron Yard\">The Iron Yard</a>, et al), for instance—but I think regulation is integral to the continued success of these programs.  Right now, who’s to stop a hack from opening up a 10 week program, utilizing freely available Ruby on Rails tutorials, and charging $10,000 a head? Nothing wrong with the freely available tutorial jaunt (perhaps even in these programs…), but if I’m paying ten thousand bucks or higher, I’d be much more comfortable knowing that my mentor is legit (years of service or other credentials) and the track I’m following is certified in some way. Post-secondary education regulation would also make the programs themselves more legit in the eyes of would-be employers. I think we can all agree: a regulated, accredited post-secondary education line on your resume looks a lot better than ”<strong><em>Learn Yourself Ruby on Rails</em>, taught by Bill</strong>”. Just my two cents. What do you think? Is California stifling innovation by attempting to over-regulate these programs, or is fraud-prevention a valid concern for these programs? <em>via <a href=\"http://venturebeat.com/2014/01/29/california-regulator-seeks-to-shut-down-learn-to-code-bootcamps/\" title=\"Venture Beat\">http://venturebeat.com/2014/01/29/california-regulator-seeks-to-shut-down-learn-to-code-bootcamps/</a></em>  </p>","frontmatter":{"title":"California bureau seeking regulation for learn to code bootcamps","date":null}}},"pageContext":{"slug":"california-bureau-seeking-regulation-for-learn-to-code-bootcamps","blogpath":"blog/2014/california-bureau-seeking-regulation-for-learn-to-code-bootcamps","type":"blog","jekyllDate":"2014-01-30"}}