{"data":{"markdownRemark":{"html":"<p><strong>Update October 2013</strong>: This little trick is no longer necessary. It looks like Microsoft has added the option to add an existing email address as a Microsoft account alias, which is what this hack was getting at. Now, to use your domain, you will simply select the radio button “Add an existing email address as a Microsoft account alias,” then fill in your desired email address. I recently got an email address with Outlook.com. Why? No reason, really, except to reserve my name for my email address. Call me vain, but if I ever DID decide to switch from gmail to outlook, I’d rather have a <strong>dstrunk (at) outlook (dot) com</strong> email address vs <strong>XXdstrunk011986@outlook.com</strong>. Anyway; I wanted to add my domain alias to outlook, so emails that are sent via my dstrunk.com portfolio site are forwarded to my outlook account. Problem is, the only options available for creating aliases are Microsoft’s domains: <strong>outlook.com</strong>, <strong>hotmail.com</strong> or <strong>live.com</strong>. I didn’t want <strong>any</strong> of those! So, I figured I’d try to add an option in the select box and submit the added data. This next bit assumes you’re using either Chrome or Firefox (both of which have fabulous web developer toolkits baked in).</p>\n<p><small><strong>A preliminary note</strong>: You will need to ensure that the email address you are aliasing is set up to send to your outlook.com email address. If you’re using shared hosting like I am, this should be as easy as adding the outlook.com address to the list of emails to forward to; this will depend on your hosting provider, however. If you’re not sure how to do this, contact your hosting administrator.</small></p>\n<ul>\n<li>First, you’ll need to create an Outlook alias. Click on the gear icon on the top right of your mail. It will take you to your inbox options. Click on “Create an Outlook alias”. The next screen should look like the below. You’ll note that the only available options for your alias are <strong>outlook.com</strong>,** hotmail.com** or <strong>live.com</strong>.</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083578/Screen-Shot-2013-03-14-at-10_06_28_v7r7mq.png\" alt=\"Screenshot of the Outlook alias page\"></p>\n<ul>\n<li>In either Chrome or Firefox, using the web inspector, find the select dropdown. (In chrome: right-click, <em>Inspect Element</em>, drill down until you find the select, as in the below screenshot).</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083578/Screen-Shot-2013-03-14-at-10_09_51_vavxxx.png\" alt=\"Screenshot showing Web Inspector\"></p>\n<ul>\n<li>Now that you’ve found the element, right click the web inspector, and click “<em>Edit as HTML</em>”.</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083577/Screen-Shot-2013-03-14-at-10_10_17_eu7kzz.png\" alt=\"Edit as HTML\"></p>\n<ul>\n<li>In the below screenshot, you’ll see I’ve added my own domain to the options. The <strong>value</strong> attribute is the important thing on this one.</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083576/Screen-Shot-2013-03-14-at-10_10_38_t5mp6w.png\" alt=\"Email added to the list of options\"></p>\n<ul>\n<li>Now you’ll see the dstrunk.com domain has been added to the list of selection options.</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083576/Screen-Shot-2013-03-14-at-10_10_48_wmlqlx.png\" alt=\"Email added to the list of options\"></p>\n<ul>\n<li>I then submitted the data to the server, expecting some sort of error. But everything returned fine, and, once I confirmed that I could receive mail from the dstrunk.com domain, I was set to receive emails on Outlook!</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083575/Screen-Shot-2013-03-14-at-10_11_01_zbd5lk.png\" alt=\"Success!\"></p>","frontmatter":{"title":"custom email aliases in Outlook.com","date":null}}},"pageContext":{"slug":"custom-email-aliases-in-outlook-com","type":"blog","jekyllDate":"2013-03-14"}}