{"data":{"markdownRemark":{"html":"<p>Hey everyone! It’s a little late, but Happy New Year. Nothing too technical in this post, but I’d like to go over some of my goals for the new year.</p>\n<h2>2014: A retrospective</h2>\n<p>Last year, I began my journey into Ruby and Rails development.* After learning the basics and going through tutorials for the first couple of months, I created my first basic app: A URL shortener. The app was/is riddled with errors, and suffers from no tests whatsoever, but I learned a lot of valuable information that carried over into other projects (namely, handling state, more interesting uses for writing to the database than simple CRUD apps, and dynamic redirects).</p>\n<p>After creating this simple app, I began attempting a bear of a project. This project, while uncompleted, took me down the rabbit hole of form objects, service objects, proper testing practices, big O notation, and front-end JS frameworks. While the app itself never saw the light of day, it opened my eyes to a lot of computer science fundamentals that my graphic design background never would have introduced me to. I ended up with a lot of programming books, and reading more than I have since college.</p>\n<h2>2015: onward and upward</h2>\n<p>This year is more of the same in some ways. Of course the common resolutions are on my list (lose weight, go to the gym, etc. I’m basic)—but I’m also looking to build on last year’s goal of diving deeper into web development. Here’s the long and short list:</p>\n<ul>\n<li>I have a couple of apps that I <strong>know</strong> I can complete from my current skill level (TDD best practices included)</li>\n<li>I plan to rewrite my URL shortener, this time also employing TDD best practices.</li>\n<li>While freelancing, I plan on landing a client for which Ruby will be a good fit.</li>\n<li>My “bear of a project” will get some work—I want to create this app and nothing will stop me, no matter how long it takes :)</li>\n<li>Potentially apply to either a bachelor’s or a master’s program in computer science.</li>\n</ul>\n<p>So there you go—onward and upward to 2015 and beyond! What kind of resolutions do you have for yourself?</p>\n<p>*<small>Note I said Ruby <strong>and</strong> Rails, not Ruby <strong>on</strong> Rails. While I love Rails, too many people ignore the fact that Rails is a framework, not a language. Perhaps it’s a good sign that the framework is so strongly supported by the community that Ruby is ubiquitous with Rails, but I felt the distinction was necessary. <strong>You are not your framework.</strong></small></p>","frontmatter":{"title":"Happy new year!","date":null}}},"pageContext":{"slug":"happy-new-year","type":"blog","jekyllDate":"2015-01-07"}}