{"data":{"markdownRemark":{"html":"<p>Last Friday I attended my first ever Hackathon, and I had a blast! Let’s back up a bit. I was recently made aware of a monthly hackathon called <a href=\"http://firstfridayhackathon.com/\">First Friday Hackathon</a>, a four hour event taking place simultaneously around the state of Georgia. Normally, an event like this would be reserved for a larger city such as Atlanta, but surprisingly Columbus was one of the host cities! A friend of mine was going and invited me, and I thought, “Sure, why not.” Walking in, I’ll admit I was pretty nervous; I didn’t know what to expect. Although I only knew my friend, I was quickly introduced to a bunch of people from all walks of life: students, web professionals, DIY-enthusiasts, and hardware and software hackers. The host of the Hackathon, Lucas of <a href=\"http://standandstretch.com/\">Stand and Stretch</a>, gave everyone a brief overview of what could be expected: work on a project of your choosing in four hours, and at the end you will demonstrate your project to everyone, who will then vote on the most innovative project. Other attendees projects ranged from creating an augmented reality game using Unity to developing an automated <a href=\"http://www.thinkgeek.com/product/8a0f/\">USB rocket launcher</a> that fires based on facial recognition. I was struggling to find a project worthy of a hackathon. In the end, I settled on creating a simple watermark generating script using command line tools and <a href=\"http://www.imagemagick.org/\">ImageMagick</a> as a proof of concept for future projects. Not the most “wow”-worthy project I admit, but it was something I’d been interested in doing. Here are the steps I took:</p>\n<ul>\n<li>I started by installing ImageMagick and Ghostscript, which honestly took longer than the actual command line scripting did. Those libraries are HUGE!</li>\n<li>After installing, I <code class=\"language-text\">cd</code>ed into the target directory with terminal. Using ImageMagick’s suite of features, I determined the target’s dimensions using <code class=\"language-text\">identify target-image.png</code>.</li>\n<li>Next, I created an image with a transparent background that was the same dimensions as the target image: <code class=\"language-text\">convert -size WIDTHxHEIGHT xc:transparent -pointsize 25 -fill Red -draw &quot;text 230,375 &#39;WATERMARK TEXT HERE&#39;&quot; watermark-text.png</code>.</li>\n<li>Finally, I used ImageMagick’s <code class=\"language-text\">composite</code> command: <code class=\"language-text\">composite -dissolve 50% -quality 100 watermark-text.png target-image.png output.png</code>. Here’s the breakdown for those commands: - <code class=\"language-text\">composite</code> combines the images</li>\n<li><code class=\"language-text\">-dissolve 50%</code> makes the overlay image 50% transparent</li>\n<li><code class=\"language-text\">-quality 100</code> keeps the quality at 100%</li>\n<li><code class=\"language-text\">watermark-text.png</code> is the image with text</li>\n<li><code class=\"language-text\">target-image.png</code> is the original image</li>\n<li><code class=\"language-text\">output.png</code> is the merged images</li>\n</ul>\n<p>Et voila! A watermark for your images. Now that I know how to do this with the command line, my next steps are to use the <strong>rmagick</strong> and <strong>rghost</strong> Ruby libraries (Ruby implementations of ImageMagick and Ghostscript) to develop a web app that can batch process and add watermarks to images. And the use-cases don’t end there; theoretically, it would be possible to create a full-featured web-to-print system, where a user inputs information into a form, the form information generates a PDF and the PDF is sent to a printer. Using a service such as <a href=\"https://www.lob.com/\">Lob</a>, even the printing and shipping could be automated via their API, resulting in a potential passive income stream. Perhaps that will be my next hackathon project :)</p>","frontmatter":{"title":"My first hackathon","date":null}}},"pageContext":{"slug":"my-first-hackathon","type":"blog","jekyllDate":"2014-03-13"}}