{"data":{"markdownRemark":{"html":"<p>If you’ve ever done work for a government, financial or B2B organization, you might find yourself needing to support Internet Explorer 8. I know, I know: you’ve made your case for dropping support, pointing out that <a href=\"http://www.zdnet.com/article/salesforce-to-drop-ie7-and-ie8-support-in-may-2015/\">large</a> <a href=\"http://zurb.com/article/1265/ie8-is-going-the-way-of-the-dodo-so-why-s\">SaaS</a> <a href=\"http://thenextweb.com/google/2013/09/16/google-analytics-to-drop-internet-explorer-8-support-at-the-end-of-2013/\">companies</a> are dropping support (or dropped support years ago), Microsoft itself is <a href=\"http://www.techtimes.com/articles/12722/20140811/17-months-until-ie8-support-ends.htm\">dropping support soon</a>, development time could double, etc. But higher ups point out that 10+% of users are locked into IE8, and until corporate IT is able to justify OS upgrades, we’re stuck.</p>\n<p>Don’t fret too much. It’s still possible to create a modern site and provide a pretty decent user experience on these older browsers, with some caveats. It probably won’t be a completely 1-to-1 experience from IE8 to a modern browser, but it should be enough to allow you to develop using best practices going forward while creating a not-completely-hideous result in IE8. Here are some of the tools you’ll need in your toolbox:</p>\n<ul>\n<li><a href=\"http://www.paulirish.com/2011/the-history-of-the-html5-shiv/\">HTML5 Shim</a> - Adds browser support for HTML5 elements, including <code class=\"language-text\">header</code>, <code class=\"language-text\">footer</code>, <code class=\"language-text\">aside</code>, <code class=\"language-text\">main</code>, and others.</li>\n<li><a href=\"http://jquery.com/download/\">jQuery 1.x</a> - the 1.x versions of jQuery have promised support for Internet Explorer 6, 7 and 8. This gives us the jQuery we’re all used to with a guarantee our JavaScript should Just Work.</li>\n<li><a href=\"http://selectivizr.com/\">Selectivizr</a> - adds CSS3 selectors for IE. This can be important if you’re using a grid framework that makes use of <code class=\"language-text\">nth-child</code> to clear elements, for example.</li>\n<li><a href=\"https://github.com/scottjehl/Respond\">RespondJS</a> - a polyfill for CSS3 media queries. This is important if you’re building a mobile-first website, as IE6-8 don’t support media queries.</li>\n<li><a href=\"https://github.com/es-shims/es5-shim\">ES5 shim (and optionally ES5 sham)</a> - <strong>ES5 shim</strong> monkey patches JavaScript to contain ES5 methods that can be faithfully emulated. <strong>ES5 sham</strong> monkey patches other methods as closely as possible, or allows them to silently fail instead of causing runtime errors. <em>Use ES5 sham at your discretion.</em></li>\n</ul>\n<p>The next two links are especially handy. They allow for some nicer CSS decoration techniques that we’ve become used to that otherwise wouldn’t be possible on legacy browsers.</p>\n<ul>\n<li><a href=\"http://css3pie.com/\">CSS3 PIE</a> - This polyfill adds support for <code class=\"language-text\">border-radius</code>, <code class=\"language-text\">box-shadow</code>, and <code class=\"language-text\">linear-gradient</code>. Yes, you can still have depth and detail in your IE8 designs!</li>\n<li><a href=\"https://github.com/louisremi/background-size-polyfill#readme\">Background cover</a> - Useful for full-container images. This will ensure your <code class=\"language-text\">background-size: cover</code> or <code class=\"language-text\">background-size: contain</code> behaves as expected.</li>\n</ul>\n<p>In addition to the links above, you’ll most likely have to make consessions for IE8 in your CSS. Things like a margin not working will have you climbing up the walls! Here are some common ones that I’ve come across:</p>\n<ul>\n<li><a href=\"http://stackoverflow.com/questions/13911010/top-margin-doesnt-work-in-ie-8\">Top margin doesn’t work in IE8</a> - This is a <a href=\"http://www.inventpartners.com/ie8_margin_top_bug\">known bug</a>, and a pretty easy fix. Just add <code class=\"language-text\">overflow: auto</code> to the clearing div.</li>\n<li><strong>I want to add a transparent div / blur / shadow!</strong> - Here’s a fun one. IE CSS has a property called <code class=\"language-text\">filter</code>. This property accepts several attributes, all noted <a href=\"https://msdn.microsoft.com/en-us/library/ie/ms530752%28v=vs.85%29.aspx\">here</a>. A good reference I found for transparent backgrounds in particular is on <a href=\"https://css-tricks.com/rgba-browser-support/\">CSS Tricks</a>. These will definitely muck up your stylesheets, but if you want to provide a better user experience for your IE8 users, this is one of the ways.</li>\n</ul>\n<p>I’m working on a rather large project redesign that needs IE8 support, so I’m sure I’ll find more issues in the future. But for now, the above tips and hacks have definitely kept me sane as I build out a modern experience that needs to support outdated browsers.</p>\n<p>Now, you might have no real choice in supporting IE8 if you’re in the public sector or financials. But if you’re a freelancer? Make the same case for dropping support at the top of this article, and also charge double for IE8 support and testing :)</p>","frontmatter":{"title":"Polyfills and shims for IE8 support","date":null}}},"pageContext":{"slug":"polyfills-and-shims-for-ie8-support","type":"blog"}}