{"data":{"site":{"siteMetadata":{"title":"Daniel Strunk","author":"@dstrunk"}},"markdownRemark":{"id":"cba50c3e-1f88-53d7-93dd-94bcd1a9689e","excerpt":"This week I decided to dive into learning a frontend technology that’s been gaining serious traction in the Magento crowd: React and Progressive Web Apps…","html":"<p>This week I decided to dive into learning a frontend technology that’s been gaining serious traction in the Magento crowd: React and Progressive Web Apps (otherwise known as PWAs). GatsbyJS seemed like a great lower-barrier entry into both React and PWAs, with its fantastic documentation, strong community and abundant tutorials. I have previous experience in <a href=\"https://vuejs.org\">Vue</a> from building a larger Laravel application in my spare time, so picking up React has been (mostly) learning syntax.</p>\n<p>To learn Gatsby, I decided to revamp my blog. It’s a prime candidate for this type of project: it’s already built on GitHub Pages using Jekyll, which means all pages are flat files. Gatsby also has a plugin for deploying to GitHub Pages, which means I can continue hosting there and not worry about finding a new host and updating DNS.</p>\n<h2>Next week</h2>\n<h3>Advanced React with Wes Bos</h3>\n<p>Learning React and GraphQL in more depth has been on my radar for some time. I purchased <a href=\"https://advancedreact.com/\">Wes Bos’s Advanced React</a> as soon as it was released, but have not fully completed it. In Advanced React, Wes uses the popular GraphQL client <a href=\"https://www.apollographql.com/\">Apollo</a> alongside Gatsby to create a fully-functional PWA storefront. It’s pretty clear that Magento is going all-in on GraphQL and React (which I consider a good thing for the most part), so I think it’s in my best interest to stay ahead of the curve by really grokking the concepts introduced in Wes’s Advanced React course.</p>","frontmatter":{"title":"GatsbyJS and GitHub Pages","date":"2019-25-01"}}},"pageContext":{"slug":"journal/2019/gatsby-js-github-pages","previous":null,"next":{"fields":{"slug":"til/2019/hello-world"},"frontmatter":{"title":"Hello, World!","slug":"hello-world"},"fileAbsolutePath":"/Users/dstrunk/Code/JavaScript/danielstrunk/content/til/2019/01-27-hello-world/index.md"}}}