{"data":{"markdownRemark":{"html":"<p>I’ve been a big fan of <a href=\"http://rvm.io\">RVM</a> for a while now. I started using it when I first began developing Rails apps my first go-around (not this 100+ day streak, but about six months prior). It is great for getting up to speed quickly, and it does its job well. I even backed it on Bountysource! But it does too much (for me). That might sound ridiculous, but a core tenet of the UNIX philosophy is for tools to do one thing, and do them well. Following this ideology, RVM is too powerful—maintaining Ruby versions in addition to installing Rubies and maintaining gemsets. In an attempt to better follow this idea, I took this weekend to switch from RVM to <a href=\"http://rbenv.org\">rbenv</a>. To keep the functionality provided from RVM, I also made sure <a href=\"http://bundler.io\">Bundler</a> and <a href=\"https://github.com/sstephenson/ruby-build\">ruby-build</a> were installed to manage gemsets and installing Rubies, respectively. There were a couple of hiccups along the way, but I managed to clean up my file system and get everything back to where it needs to be for continued development. Rather than rehash other peoples’ work, here are some great guides to get people interested in Ruby on Rails development up to speed. The first link details how to set up a Rails environment from scratch, and the second link details how to switch from RVM to rbenv (what I needed):</p>\n<ul>\n<li><a href=\"http://www.createdbypete.com/articles/ruby-on-rails-development-setup-for-mac-osx/\">http://www.createdbypete.com/articles/ruby-on-rails-development-setup-for-mac-osx/</a></li>\n<li><a href=\"http://robots.thoughtbot.com/using-rbenv-to-manage-rubies-and-gems\">http://robots.thoughtbot.com/using-rbenv-to-manage-rubies-and-gems</a></li>\n</ul>\n<p>Another thing that might interest users looking to get started with Rails development, but might not be tech-savvy enough to fool with the command line: <a href=\"https://github.com/tokaido/tokaidoapp\">Tokaido</a>. Tokaido is a Kickstarter-funded project created by developer heavy-hitter <a href=\"http://yehudakatz.com/\">Yehuda Katz</a>. I haven’t personally tried it out yet, but the app is aimed at making the development setup of Rails painless for new users.</p>","frontmatter":{"title":"Switching from RVM to RBenv (and other miscellany)","date":null}}},"pageContext":{"slug":"switching-from-rvm-to-rbenv-and-other-miscellany","type":"blog"}}