{"data":{"markdownRemark":{"html":"<p>I can’t seem to get enough of these flat-file CMSes lately! While I enjoy WordPress development, I think we can all agree that WordPress can be overkill for many clients’ needs. To that end, I’ve been playing around with a new flat-file PHP CMS I found recently, called <a href=\"http://monstra.org/\" title=\"Monstra CMS\">Monstra CMS</a>.* *<small>Just because I haven’t played around with a ton of flat-file CMSes lately (<a href=\"http://www.staceyapp.com/\" title=\"Stacey\">Stacey</a> and <a href=\"http://getkirby.com/\" title=\"Kirby\">Kirby</a> are the only ones I’m truly familiar with), you may see comparisons to them.</small></p>\n<h2>Before we start</h2>\n<p>There are some things you need to understand when using Monstra: first and foremost, it’s a CMS for developers. The WYSIWYG editor is minimal and expects the editor to have knowledge of HTML. Creating themes and snippets is easy, but requires knowledge of minor PHP. You could hand off a Monstra-powered site to a client, but I would plan on making it completely idiot-proof and still expecting something to break via the editor occasionally. Of course, when it comes to breaking things, clients will always find a way ;). Now…</p>\n<h2>The good</h2>\n<ul>\n<li><strong>Monstra is completely open-source (read: free to use!).</strong> Use it to your heart’s desire! This is a big one for me. I was previously (and still am, to a certain extent) enamored with the Kirby CMS, but was a bit put off by the license. $49 per site isn’t insane per say, but coming from the world of WordPress, it could be a deal breaker for some. Monstra doesn’t have this cash restriction, which is nice.</li>\n<li><strong>Twitter bootstrap</strong>; the front end is built on this. That makes for quick and easy development, easy extendability, and a mobile-ready site out of the gate with their default theme.</li>\n<li><strong>The dashboard is easily understandable to those familiar with the WordPress dashboard.</strong> I really like the admin side; it’s surprisingly robust for a flat-file system. Supporting things like semi-advance metadata configuration, simple access views, and templating, you can tell that Monstra was developed with an eye toward WordPress.</li>\n</ul>\n<p><img src=\"http://res.cloudinary.com/dstrunk/image/upload/v1414083574/Screen-Shot-2013-04-16-at-09_59_15_f71rtz.png\" alt=\"Monstra admin page\"></p>\n<ul>\n<li><strong>Blocks.</strong> It’s easy to create a block of formatted text that can be injected into other pages via either a shortcode (Monstra uses curly braces instead of square braces) or PHP.</li>\n<li><strong>User administration.</strong> for a simple CMS, this is surprisingly robust. You can set up editors for the back end, restricting editors to page creation and editing, or you can set up users, and restrict page views to logged in users.</li>\n<li><strong>Update (2013-18-06):</strong> <strong>Active central plugin repository.</strong> Many thanks to <a href=\"http://awilum.monstra.org/\" title=\"SERGEY ROMANENKO | Awilum\">Sergey (Awilum)</a>, the creator of Monstra, for notifying me of this. It looks like <a href=\"http://plugins.monstra.org\" title=\"Monstra: Plugins\">http://plugins.monstra.org</a> is now live, with a healthy number of useful plugins available. There are the usual suspects, such as a blog plugin, a guestbook or a contact form. These are expected plugins, but their arrival shows that Monstra isn’t just another flash in the pan.</li>\n<li><strong>Upadate (2013-18-06): Active forum.</strong> The forum seems well-populated, with developers ready to answer questions and troubleshoot for you. A definite plus.</li>\n</ul>\n<h2>The bad</h2>\n<ul>\n<li><strong>The <a href=\"http://monstra.org/documentation\" title=\"Monstra documentation\">documentation</a> for Monstra is slim to none in most places.</strong> I really hope they address this soon; lack of proper documentation just stinks of laziness. The bit of good news in this area is, at least the actual code is properly documented.</li>\n<li><del><strong>No active central plugin site.</strong> This just comes down to Monstra’s “wet behind the ears” nature, but the plugin site (<a href=\"http://plugins.monstra.org/\" title=\"Monstra Plugins\">http://plugins.monstra.org/</a>) takes you to a coming soon page. It’s smart that the developer chose to have a central plugin site, but, well, it’s not up yet.</del><strong>Update:</strong> see the good :)</li>\n</ul>\n<p>Some questionable calls were made; things like recreating a WYSIWYG editor instead of using the robust and extendable <a href=\"http://www.tinymce.com/\" title=\"Tiny MCE\">TinyMCE</a>, for example. I understand that it’s a great learning exercise to recreate something from scratch, but the WYSIWYG editor of Monstra feels incomplete and a bit cumbersome, in my opinion. I couldn’t see handing this off to a client with the editor in its current state. Compared to Kirby, Monstra’s code base is a bit more schizophrenic. Don’t get me wrong; it’s well-done, and everything works as expected. It’s just that Kirby’s structure was so well-defined and open to extendability. Kirby’s code was a joy to dig through and extend, and (coming from a junior back-end developer, at least), Monstra’s code feels a bit less structured. I honestly think that comes down to Kirby CMS’s use of the <a href=\"http://toolkit.getkirby.com/\" title=\"Kirby Toolkit\">Kirby PHP toolkit</a>; that thing abstracts away a <strong>ton</strong> of complex PHP code, kind of acting like a jQuery for PHP (sorry, this is a Monstra review, not Kirby!). I honestly feel bad writing about those first two points; it’s obvious that Monstra is a newcomer to the CMS scene, and these things can easily be fixed in the future. But so it goes.</p>\n<h2>Conclusion</h2>\n<p>At the end of the day, Monstra is a solid choice for simple site development. Its early development cycle shows in places, and the lack of documentation means that you better be comfortable with PHP development if something breaks, but I’m confident that Monstra can hold its own against other, more mature CMSes. If you’re looking into flat-file based CMSes, I’d keep my eye on Monstra. <em>site:</em> <a href=\"http://monstra.org/\" title=\"Monstra\">Monstra</a></p>","frontmatter":{"title":"Monstra: a flat-file CMS","date":null}}},"pageContext":{"slug":"monstra-a-flat-file-cms","blogpath":"blog/2013/monstra-a-flat-file-cms","type":"blog","jekyllDate":"2013-04-16"}}