{"data":{"markdownRemark":{"html":"<p>I’ve been on shared hosting for the better part of 10 years now. My first servers were on <a href=\"http://www.1and1.com/\">1and1</a>, and more recently, <a href=\"http://www.dreamhost.com/\">Dreamhost</a>. To their credit, both hosting providers did their jobs admirably, making it easy for me to setup and host WordPress sites with ease. However, their shortcomings revealed themselves as I began wanting to serve anything other than a PHP-based stack. Rails applications were possible, but tricky to setup. Ruby versions were out of date, with no way to update. Node apps were a no-go (unless you upgraded to their more expensive VPS services).</p>\n<p>Over the weekend, I decided to finally take the plunge and move from shared hosting to a VPS—namely, <a href=\"https://www.digitalocean.com/\">DigitalOcean</a>. Along with that move, I decided to forego WordPress and migrate everything over to <a href=\"http://ghost.org\">Ghost</a>.</p>\n<h2>First thing’s first</h2>\n<p>To move from WordPress to Ghost, you’ll need a plan of attack. Your checklist should include the following:</p>\n<ul>\n<li>Migrate comments to <a href=\"https://disqus.com/\">Disqus</a></li>\n<li>Migrate images to <a href=\"http://cloudinary.com/\">Cloudinary</a> (using Cloudinary’s WordPress plugin, this is dead simple)</li>\n<li>Generate a Ghost JSON file to import into Ghost (using Ghost’s WordPress plugin this is easy as well)</li>\n</ul>\n<p>DigitalOcean has handy one-click installs of common stack-related setups, as well as your run-of-the-mill WordPress installs, a Ghost install, etc. As I have a couple of different configurations necessary, I went with a <strong>LEMP</strong> stack—Linux, Nginx, MySQL and PHP.</p>\n<p>Not wanting to <a href=\"http://dstrunk.com/2014/08/12/site-updates-301-redirects/\">leave my visitors in the dust</a>, I went through the entire site and noted all of the URL changes that would occur with Ghost, creating a lengthy rewrite file for Nginx.</p>\n<h2>Setup</h2>\n<p>After taking care of the preliminary work above, setup was pretty straightforward. One of the strongest things going for DigitalOcean is their community forums and tutorials. For setting up Ghost with Nginx, I followed <a href=\"https://www.digitalocean.com/community/tutorials/how-to-host-ghost-with-nginx-on-digitalocean\">this tutorial</a>. As I’d already selected the LEMP stack provided by DigitalOcean, the only to-dos were installing <a href=\"http://nodejs.org/\">NodeJS</a> and configuring <a href=\"http://upstart.ubuntu.com/\">Upstart</a> to automatically start / restart if the server goes down.</p>\n<p>The only place I really deviated from the tutorial: I am planning on hosting a couple of different websites on this server, so I decided to choose a different folder to install ghost to, and specified said directory in my Nginx setup.</p>\n<h2>Sharing</h2>\n<p>One thing I missed from WordPress is its plugin support for auto-posting to Twitter / LinkedIn / whatever. No worries, though; we’re a resourceful bunch, and we can figure that out.</p>\n<p>What I did is set up a couple of <a href=\"https://ifttt.com\">IFTTT</a> recipes. Add a new recipe that says, “If a new RSS item is posted, submit a link to { <em>social network of your choice</em> }.” Pretty simple!</p>\n<h2>In summary</h2>\n<p>I’m very happy with my current setup. Linux + Nginx is very amenable to all sorts of configurations—Node, Rails, and PHP have all run side-by-side on my new server at one point this weekend.</p>\n<p>Have any questions? Comment below!</p>","frontmatter":{"title":"Migrating from WordPress to Ghost","date":null}}},"pageContext":{"slug":"migrating-from-wordpress-to-ghost","blogpath":"blog/2014/migrating-from-wordpress-to-ghost","type":"blog","jekyllDate":"2014-10-27"}}