{"data":{"markdownRemark":{"html":"<p><strong>07/02/13 Update:</strong> One thing I failed to consider when this was originally written up was loading plugins that also utilize the script you are asynchronously loading. In my case, and I’m sure there are <a href=\"http://stackoverflow.com/questions/15972757/getting-jquery-validation-plug-in-to-work-with-requirejs\">many</a> <a href=\"http://wordpress.stackexchange.com/questions/50522/require-js-to-load-javascript\">others</a> with this problem, jQuery. If another WP plugin lists jQuery via an <em>enqueue_script</em> in the <strong>functions.php</strong>, you will have two versions of jQuery, which is no bueno. There are <a href=\"http://core.trac.wordpress.org/ticket/23285\" title=\"Make WordPress Core - AMD\">some tickets open</a> to implement AMD into WordPress core, but I don’t think there’s a clean solution for this yet. Just a heads up before reading the article below.</p>\n<p>This is a pretty handy trick for optimizing your WP build for mobile development. I was developing a framework, and wanted to conditionally load either jQuery for desktop environments or Zepto for mobile environments. Rather than going the traditional route of using <strong>wp<em>register</em>script()</strong> for both libraries, then conditionally enqueuing the script based on browser sniffing via PHP, I decided to use <a href=\"http://requirejs.org/\" title=\"RequireJS\">RequireJS</a>.</p>\n<h2>Why RequireJS?</h2>\n<p>RequireJS is a handy JavaScript file and module loader that loads scripts asynchronously. There’s a few reasons for this. Loading scripts asynchronously improves the loading speed of your web page, code is more modular and thus easier to use, and it helps to maintain dependencies. Also, it’s a challenge.</p>\n<h2>Getting started</h2>\n<p>I wanted to use RequireJS to conditionally load either jQuery or Zepto, depending on if users were using mobile devices or not. So, first thing was first: detecting browsers. Here’s the code I used:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">var isMobile = function() { return navigator.userAgent.match(/Mobile|iP(hone|od|ad)|Android|BlackBerry|IEMobile|Kindle|NetFront|Silk-Accelerated|(hpw|web)OS|Fennec|Minimo|Opera M(obi|ini)|Blazer|Dolfin|Dolphin|Skyfire|Zune/); }</code></pre></div>\n<p>That gnarly bit of regex should detect around 98% of mobile use cases. Now that I had my detection function, I used RequireJS to determine my path based on the results:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">require({ &quot;paths&quot; : { &quot;lib&quot; : (isMobile()) ? &quot;/lib/zepto/zepto.min&quot; : &quot;/lib/jquery/jquery.min&quot; } });\nrequire([&#39;lib&#39;], function($) {\n\t// JavaScript / jQuery / Zepto goes here\n});</code></pre></div>\n<p>I added this script to my <strong>footer.php</strong>, loaded up my local environment, and immediately noticed a problem: my path was wrong. But how could I avoid hardcoding the theme path into my JavaScript file? Well, luckily WordPress has thought of that. WordPress comes with a handy function called <strong>wp<em>localize</em>script()</strong>. With this function, it’s possible to pass off back-end specific variables as objects to the script of your choice. Using this, it’s possible to pass the directory uri to a JavaScript object which can then be used to determine the path of the scripts that we’ll be loading. Here’s my code below, to be dropped in your **functions.php **(obviously, change your scripts to their proper name/path/etc.:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// require.js wp_register_script( &#39;require-js&#39;, get_stylesheet_directory_uri() . &#39;/assets/js/lib/require/require.min.js&#39; );\n\n// my script, main.js\nwp_register_script( &#39;main-js&#39;, get_stylesheet_directory_uri() . &#39;/assets/js/main.js&#39;, array( &#39;require-js&#39; ), &#39;&#39;, true);\n\n// Add the WP_DIRECTORY object directory.path to the script main-js\n// note that `directory` is the object, and `path` is the object&#39;s property.\n$WP_DIRECTORY = array( &#39;**path**&#39; =&gt; get_stylesheet_directory_uri() . &#39;/assets/js&#39; ); wp_localize_script( &#39;main-js&#39;, &#39;**directory**&#39;, $WP_DIRECTORY );</code></pre></div>\n<p>Here you see I’ve registered requireJS and my main.js script. The script “<em>main-js</em>” now had access to the object <strong>directory</strong>, which had the property <strong>path</strong>, which allowed me to pass in the stylesheet directory of my theme structure. This is extremely handy seeing as I’m developing a framework that will be renamed often. Now that I had access to the directory uri in a modular way, I amended my require code to account for that: require({ “paths” : { “lib” : (isMobile()) ? <strong>directory.path +</strong> “/lib/zepto/zepto.min” : <strong>directory.path +</strong> “/lib/jquery/jquery.min” } });</p>\n<p>Refreshing my browser now asynchronously loaded either jQuery or Zepto, depending on which user agent was returned. Success!</p>\n<h2>Going forward</h2>\n<p>Using RequireJS to conditionally load libraries is just the beginning. In the future, I’ll experiment using RequireJS to use a client-side templating system such as <a href=\"http://handlebarsjs.com/\" title=\"Handlebars\">Handlebars</a> to clean up that nasty WP Loop, and help keep business logic out of my presentation.</p>","frontmatter":{"title":"Loading conditional libraries in WordPress with RequireJS","date":null}}},"pageContext":{"slug":"loading-conditional-libraries-in-wordpress-with-requirejs","blogpath":"blog/2013/loading-conditional-libraries-in-wordpress-with-requirejs","type":"blog","jekyllDate":"2013-03-25"}}