{"data":{"markdownRemark":{"html":"<p>This week was a little shorter than usual; due to a bachelor party weekend with one of my good childhood friends in the mountains, I’ll be unavailable Thursday and Friday. But that doesn’t mean this week has been bereft of learning! I’ve been chugging away at the <em>Rails 4 in Action</em> book some more. The last two weeks dealt with user sign-ins, namespacing for admin access, and semi-heavy authentication using Ryan Bates’ <a href=\"https://github.com/ryanb/cancan\">CanCan</a> gem. This week I worked on attaching files to tickets using <strong>CarrierWave</strong>, and making sure the path for these files wasn’t accessible to unauthorized users.  I also restarted the Ruby on Rails tutorial, which takes a would-be Rails developer through building a Twitter clone. Instead of mindlessly following this tutorial, I’m reading the intro text for each chapter, attempting to write my unit tests, then falling back on the tutorial if things go awry. So far so good; in addition to making me more comfortable with writing tests on my own, I’m gaining confidence in key areas sure to come up in any project (authentication, etc). Taking a page from <a href=\"http://thoughtbot.com\">Thoughtbot’s</a> development practices, I’ve decided to make a switch from <a href=\"http://www.sublimetext.com/\">Sublime Text</a> to <a href=\"http://www.vim.org/\">Vim</a>. More on that in a future blog post, but surprisingly it’s been a pretty painless transition. Thoughtbot’s <a href=\"https://github.com/thoughtbot/dotfiles\">dotfiles</a> have been especially handy in getting Vim set up for efficient Rails development. I’ve got some ideas for some personal projects that I’ve started planning out … I’m excited to apply my growing dev knowledge on something that isn’t from a tutorial :)</p>","frontmatter":{"title":"Ruby and me, a short week 3 update","date":null}}},"pageContext":{"slug":"ruby-and-me-a-short-week-3-update","type":"blog","jekyllDate":"2014-02-05"}}