{"data":{"markdownRemark":{"html":"<p><a href=\"http://frankchimero.com\">Frank Chimero</a> is a prominent designer, illustrator and writer based in Brooklyn. His book, <em>The Shape of Design</em>, was funded on Kickstarter and focuses on storytelling, co-dependency and craft in the design profession. You might be saying to yourself, “That’s great and all, but … What does that have to do with your weird title?” Well, Frank recently spoke at the School of Visual Art’s Thesis Festival, and his talk (read: transcript) spoke volumes about the issues we face in the creative industry and beyond. I’ll save the metaphors (read: obscure title) for your perusal of the talk, but the gist is: as a designer or developer facing a new problem, do you attempt to completely eradicate your problem, scorched-earth style, or do you accept that the problem is chronic and instead attempt to alleviate the related issues? In my opinion, the hacker mentality is borne from the second way of dealing with problems—accepting problem constraints, then finding novel solutions to circumvent these constraints. I tend to lean toward this approach most often, as it’s less disruptive while still being effective. But the scorched earth policy is necessary at times as well; sometimes a way of doing things is so archaic and cumbersome that a complete reboot is warranted. As you approach your next design or development problem, ask yourself: does your solution need a complete reimagining of the current product? Or would it best be served by rearranging existing infrastructure to let the problem take care of itself? <strong>Only Openings:</strong><a href=\"http://frankchimero.com/talks/only-openings/transcript/\">http://frankchimero.com/talks/only-openings/transcript/</a></p>","frontmatter":{"title":"Shooting wolves and managing bears","date":null}}},"pageContext":{"slug":"shooting-wolves-and-managing-bears","blogpath":"blog/2014/shooting-wolves-and-managing-bears","type":"blog","jekyllDate":"2014-05-16"}}