{"data":{"markdownRemark":{"html":"<p><strong>First up:</strong> I updated my portfolio! The base, anyway. Projects still need to be added. You can view it here: <a href=\"http://silentpost.io/\">SILENTPOST</a> It’s built with <a href=\"https://pages.github.com/\">GitHub Pages</a>, which use <a href=\"http://jekyllrb.com/\">Jekyll</a>. More detail on that in a future post. Now that that’s out of the way, on to my Ruby update. I’ve crossed the threshold! It’s a completely arbitrary threshold I set for myself, but it feels pretty good. This post will be a reflection of everything I’ve learned over the last 100 days. A bit serendipitous that I’m wrapping up these 100 days on the eve of RailsConf 2014. Perhaps next year I’ll be going? To be honest, I thought I’d have more completed projects to show, but I really should know myself by now. Projects have been schizophrenic and varied–jumping from a URL shortener to an image to ASCII art converter and a storefront–because I get bored easily. The good news (for me) is, most of these projects are looking to wrap up at the same time. The <a href=\"https://github.com/dstrunk/img-2-ascii\">image to ASCII art converter</a> (lovingly called “imgii”) I started is wrapping up. I’m developing a gem from the proof of concept, and will be using it in a couple of dumb projects I have some ideas for. Publishing a gem is a pretty cool feeling. The url shortener is pretty much finished; it just needs a facelift from the front-end. While I usually enjoy that sort of thing, I really want to focus on Rails and not developing a UI, so it’s been put off for a while. The storefront is riffing off of the <em>Agile Web Development with Rails 4</em> book I got a couple of weeks ago. Instead of following closely with the book, I’m deviating pretty seriously in an attempt to complete a large-scale app with only light handholding. GitHub’s contributions calendar has been a great version of <a href=\"http://lifehacker.com/281626/jerry-seinfelds-productivity-secret\">Jerry Seinfield’s “Don’t break the chain” system</a> for getting better at development in general. Even if I didn’t feel like working on anything, I felt compelled to keep up my contributions streak. That obligation grows stronger the more entrenched I get, which I think is a good thing from a “get better” standpoint. That’s all for now. Looking forward to continuing development, and here’s to the next 100 days!</p>","frontmatter":{"title":"100 Days!","date":null}}},"pageContext":{"slug":"100-days","type":"blog","jekyllDate":"2014-04-25"}}