{"data":{"markdownRemark":{"html":"<p>I like to periodically read through this <a href=\"https://github.com/darcyclarke/Front-end-Developer-Interview-Questions\" title=\"GitHub - Darcyclarke - Front-end Developer Interview Questions\">github repository</a> to make sure my front end developer chops are up to snuff. I ran across one talking about event delegation, and couldn’t quite answer it. Being self-taught from the jQuery to JavaScript camp, I always handled event delegation via the jQuery-handy <strong>.on</strong> method. (A quick example: <code class=\"language-text\">$(&#39;.object&#39;).on(&#39;click&#39;, &#39;.child-element&#39;, function() {});</code>) But I didn’t really know how it worked, or why it was considered a best practice. So, to the internet!</p>\n<h2>First, event delegation with vanilla JS</h2>\n<p>Leave it to David Walsh to set me straight in an easy to understand article: <a href=\"http://davidwalsh.name/event-delegate\" title=\"How JavaScript Event Delegation Works\">http://davidwalsh.name/event-delegate</a>. Paraphrasing an already short article: Say you have a parent element with several child elements, and you want to find out when a user clicks one of those child elements. Instead of adding an event listener to the child elements (which becomes troublesome, especially if you frequently add or remove child elements), you can add an event listener to the parent element, and detect when a child element is clicked when the event bubbles up to the parent element.</p>\n<h2>What exactly is bubbling, anyway?</h2>\n<p>That led to another question: what exactly did ‘bubbling’ mean? I’d heard vaguely of events ‘bubbling’, but didn’t really understand that part either. That question lead me here: <a href=\"http://stackoverflow.com/questions/4616694/what-is-event-bubbling-and-capturing\" title=\"Stack Overflow - What is Event Bubbling and Capturing\">http://stackoverflow.com/questions/4616694/what-is-event-bubbling-and-capturing</a>. Bubbling does exactly what it sounds like. An event is captured by the inner-most element, and is propagated (or raised, or ‘bubbled’) to outer elements. Tying back into event delegation, a click event on a child element bubbles up to the parent event, which is recognized by the event delegator.</p>\n<h2>The (bubble)wrap up (I’m sorry)</h2>\n<p>Event delegation is an important topic worthy of much more than this short post—especially when considering web apps, where elements are created and destroyed by the hundreds. Not utilizing event delegation could quickly grind a web app to a halt. Conversely, utilizing event delegation results in less ties to the DOM and less memory to process.</p>","frontmatter":{"title":"JavaScript event delegation and bubbling","date":null}}},"pageContext":{"slug":"javascript-event-delegation-and-bubbling","type":"blog"}}