{"data":{"markdownRemark":{"html":"<p>In the rush to learn Rails (or any framework, for that matter), one thing that might get overlooked is security. Thoughts of “security is already baked into framework x” might be the reasoning, who knows. I’m guilty of it, and I’m sure others are in the same boat. But security of basics, like keeping your API keys and secrets <em>actually</em> secret is incredibly important, not just for the integrity of your app, but for the safety of your users. It’s also important if you’re looking to open source your app on GitHub or the like. In the past, a Rails developer might have saved their API keys and secrets in a file above the Rails app directory. Others might have hardcoded it into the app itself (bad dev!). Still others could have used the <a href=\"https://github.com/laserlemon/figaro\">Figaro gem</a>, meant to secure API keys and make deploying to Heroku with said keys easier. I opted for the Figaro route until recently. Rails 4.1 seems to take a page from Figaro’s book: it comes equipped with <code class=\"language-text\">config/secrets.yml</code>. <strong>Currently, this file is not in <code class=\"language-text\">.gitignore</code> by default, so you’ll need to add it.</strong> Afterwards, however, simply add your API keys and secrets as below:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">development:\n  secret_api_key: SOMEKEY</code></pre></div>\n<p> According to the <a href=\"http://edgeguides.rubyonrails.org/4_1_release_notes.html\">4.1 release notes</a>, secrets configured in <code class=\"language-text\">secrets.yml</code> should be accessible via <code class=\"language-text\">Rails.application.secrets</code>. For example: <code class=\"language-text\">Rails.application.secrets.secret_api_key</code> should return SOMEKEY in the development environment. Cool! You might be thinking to yourself, “that’s all well and good, but this need for secrecy has predated Rails 4.1 by a LONG time.” And you’re right. Because of this need in the past, the de facto standard for utilizing secret keys has been environment variables: <code class=\"language-text\">ENV[&quot;secret_api_key&quot;]</code>, for example. This standard has persisted because of services such as <a href=\"http://heroku.com\">Heroku</a> and documents such as <a href=\"http://12factor.net\">12factor</a>. Luckily, since YAML files get processed through ERB, you can still use environment variables. Instead of using <code class=\"language-text\">Rails.application.secrets.secret_api_key</code>, you can simply continue to use <code class=\"language-text\">ENV[&quot;secret_api_key&quot;]</code>. Sure, this way isn’t technically the “Rails way”, but it’s a solid middle ground between the “Rails way” and using gem dependencies.</p>","frontmatter":{"title":"Keep it secret, keep it safe: Using secrets.yml in Rails 4.1 to secure API assets","date":null}}},"pageContext":{"slug":"keep-it-secret-keep-it-safe-using-secrets-yml-in-rails-4-1-to-secure-api-assets","type":"blog","jekyllDate":"2014-07-09"}}