{"data":{"markdownRemark":{"html":"<p>I’ve written several toy apps over the years, created in Rails, Sinatra,\nLaravel, and, most recently, Phoenix + Elixir. Though I think it’s a great\nexercise getting your app running on a production server somewhere, for apps\nlike mine which are, in most cases, prototypes or portfolio examples, something\nlike <a href=\"https://flynn.io\">Flynn</a> might be more up your alley.</p>\n<p>Flynn is an open source Platform-as-a-Service (PaaS) for running applications in\nproduction (similar to Heroku, but on a server of your choice). Out of the box,\nit supports:</p>\n<ul>\n<li>Different buildpacks, which means all of my above applications are supported.</li>\n<li>Routes and load balances traffic for each app on the platform</li>\n<li>Includes built-in support for Postgres, MySQL and MongoDB</li>\n</ul>\n<p>Perhaps my favorite feature, though, is Flynn’s <a href=\"https://flynn.io/docs/installation/cloud\">cloud installation</a>.\nAfter installing Flynn, run <code class=\"language-text\">flynn install</code> on your local machine, and your\nbrowser will fire up with steps to install via either Amazon AWS, DigitalOcean,\nMicrosoft Azure or SSH. Since I run my portfolio apps on DigitalOcean, the only\nthing necessary for me to do was:</p>\n<ol>\n<li>Select DigitalOcean from the first step</li>\n<li>Add credentials, which includes generating an API key from DigitalOcean</li>\n<li>Install</li>\n</ol>\n<p>From there, you’re taken to a dashboard containing a barebones Flynn install on\na newly provisioned DigitalOcean server. But the coolness doesn’t end there;\nAfter connecting your GitHub account to this new Flynn installation, you’re able\nto one-click spin up any applications that happen to follow <a href=\"https://12factor.net\">12 factor\napp</a> guidelines.</p>\n<p>After discovering Flynn, I went from nothing to a host of apps running in\nseparate processes on a machine provisioned on DigitalOcean in literal minutes!</p>\n<p>Though my example was just for portfolio apps, Flynn is <strong>far</strong> more than just a\nprototyping tool—it can fully replace Heroku, providing both horizontal and\nvertical scalabiltiy quickly through their web interface. Give it a try!</p>","frontmatter":{"title":"Flynn + DigitalOcean","date":"2016-10-20 13:30:00 -0500"}}},"pageContext":{"slug":"flynn-digitalocean","type":"blog"}}