{"data":{"markdownRemark":{"html":"<p>What a terrible title. This week I’ve been working on some more business-oriented development—purchasing plans and dealing with recurring billing through <a href=\"https://stripe.com/\">Stripe</a>. Stripe is billed as “payment processing for developers” which I think is a fantastic niche to fill. Sure, Paypal is easy for end-users, but who actually builds the checkout forms? IMO it’s smart for Stripe to target developers like they are. But you didn’t come here to here me wax poetic about a company’s business model. To get started with Stripe and Rails, Stripe has a handy guide to set up your controller and add all information for a static charge: <a href=\"https://stripe.com/docs/checkout/guides/rails\">https://stripe.com/docs/checkout/guides/rails</a>. This got me going through most of the setup, and Railscasts’ episode <a href=\"http://railscasts.com/episodes/288-billing-with-stripe\">Billing with Stripe</a> helped out with the rest. Have I mentioned how great a resource Railscasts is? I highly recommend signing up for an account if you haven’t done so yet. In unrelated news, I feel like I’m finally starting to internalize the whole “MVC / way the internet works” deal. A large amount of credit goes towards a local hackathon I went to this weekend. Supporting the <a href=\"http://hackforchange.org/\">National Civic Day of Hacking</a>, we worked for 36 hours to create a service to better Columbus, GA. My partner built a backend API while I attempted to build out a front-end Single Page Application using <a href=\"http://backbonejs.org/\">BackboneJS</a>. <strong>Note to self:</strong> attempting to learn and implement a new framework in 24ish hours is not the best idea. But working with a proficient back-end developer really helped me understand better why I was doing the things I was doing. Instead of just, “Oh, it’s done this way because … that’s the way it’s done,” my understanding is now “It’s done this way because of this reason.” Which is nice. Took long enough! :)</p>","frontmatter":{"title":"Payment processing for profit","date":null}}},"pageContext":{"slug":"payment-processing-for-profit","type":"blog","jekyllDate":"2014-06-06"}}