{"data":{"markdownRemark":{"html":"<p>Over the weekend, I decided to take a page out of <a href=\"//thoughtbot.com\">thoughtbot’s</a> playbook and create a laptop script for provisioning a new development machine. <a href=\"//github.com/thoughtbot/laptop\">Their script</a> is a shell app that installs common utilities for web development, including <a href=\"//brew.sh/\">homebrew</a>, <a href=\"http://rbenv.org/\">rbenv</a>, <a href=\"https://git-scm.com/\">git</a>, <a href=\"www.postgresql.org/\">postgres</a>, and <a href=\"//redis.io/\">redis</a>, among others. I love the idea of <a href=\"//dstrunk.com/2015/06/04/automate-yourself-out-of-a-job/\">automating all of the things</a>, so I decided to piggyback onto their idea and create a laptop script of my own.</p>\n<p><a href=\"//github.com/dstrunk/laptop\">Grab the script here</a></p>\n<p>My laptop script is extremely similar to thoughtbot’s version, with some minor differences. For example, thoughbot uses zsh for their shell, but I prefer bash. There are some other command line programs I neglected to include, as I don’t use them, and I added in some minor tweaks to how the command line programs were installed. Honestly I could have just forked thoughtbot’s script and edited it to fit, but I find I learn more if I’m not mindlessly copying or editing somebody else’s programs.</p>\n<p>Also available is my <a href=\"https://github.com/dstrunk/laptop/blob/master/laptop.local\">local laptop script</a>. This script makes use of homebrew’s <a href=\"http://caskroom.io/\">cask</a> to install applications (Evernote, Dropbox and Chrome are notable examples). In addition to these apps, my local script clones <a href=\"https://github.com/dstrunk/dotfiles\">my dotfiles</a> and installs them via <a href=\"http://thoughtbot.github.io/rcm/rcm.7.html\">rcm</a>.</p>\n<p>With all of this automation, a new computer can be setup with my familiar defaults within minutes. Simply download the laptop zip file from GitHub, <code class=\"language-text\">cd</code> into the unzipped folder, and run the following:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">./laptop</code></pre></div>\n<p>Automated provisioning is great. This script takes the worry and dread out of setting up a new computer and hoping everything was taken care of, and allows for quickly getting started from scratch.</p>","frontmatter":{"title":"Automated laptop provisioning using bash","date":null}}},"pageContext":{"slug":"automated-laptop-provisioning-using-bash","type":"blog"}}