{"data":{"markdownRemark":{"html":"<p>Last night I decided to install <a href=\"www.redmine.org/\">Redmine</a> on one of my subdomains to help track my projects. Redmine is a fantastic (free!) project management app built on Rails. It’s highly customizable and enjoys all of the features that the big boys offer. It’s a great piece of software, and I highly recommend it; not only to budget-conscious outfits, but even bigger companies looking to improve their workflow. Back to last night, though. Seeing as Redmine is a Rails app, I could have run it as a Heroku app and wiped my hands of it, but I wanted more control. I’ve also had a shared hosting account on Dreamhost since forever, so I decided to test their Rails support. I’d read some horror stories in the past, but after some initial stumbling around, it wasn’t so bad.</p>\n<h2>Getting started</h2>\n<h3>Step 1</h3>\n<p>First I had to set up my subdomain. Pretty standard on Dreamhost’s end. Think up a name, configure some options (or leave them at default, which is what I did). One gotcha: Dreamhost has support for Passenger, which is typically used for Ruby or Python apps. <strong>Don’t select this for Rails apps.</strong> Dreamhost’s Passenger version is pretty much unmaintained. We’re going to go with FastCGI instead.</p>\n<h3>Step 2</h3>\n<p>After your subdomain is configured, things start go get a little non-standard (at least from my typical Dreamhost experiences). First, <code class=\"language-text\">ssh</code> into your server, and <code class=\"language-text\">cd</code> into the folder that you’re installing the app under. For Redmine, it was pretty easy to install the latest version—using Mercurial, I typed in <code class=\"language-text\">hg clone --updaterev 2.5-stable https://bitbucket.org/redmine/redmine-all redmine-2.5</code> into the terminal and watched Redmine get installed automatically.</p>\n<h3>Step 3</h3>\n<p>From there it’s a typical Rails install (for the most part). <code class=\"language-text\">cd</code> into the installed folder. Open up <code class=\"language-text\">config/database.yml</code> and configure the database settings for your production environment.</p>\n<h3>Step 4</h3>\n<p>Run <code class=\"language-text\">bundle install --without development test</code> to get the required gems for your production Redmine. I had an issue with installing RMagick on Dreamhost, so I installed gems using <code class=\"language-text\">bundle install --without development test rmagick</code>.</p>\n<h3>Step 5</h3>\n<p>Almost ready: generate a secret token for redmine: <code class=\"language-text\">rake generate_secret_token</code></p>\n<h3>Step 6</h3>\n<p>Time to instantiate the database! Run <code class=\"language-text\">RAILS_ENV=production rake db:migrate</code>.</p>\n<h3>Step 7, in three parts</h3>\n<p> Here’s where things tripped me up a bit. Dreamhost doesn’t allow webrick to run on shared hosting accounts, so I had to figure out an alternative. Luckily, it’s pretty easy to get setup once you know what to look for. In the root directory of the domain you’re looking to install Redmine / your Rails app into, create a <code class=\"language-text\">public</code> folder. You’ll be creating two files here: <strong>dispatch.fcgi</strong> and <strong>.htaccess</strong>. Here’s what your dispatch.fcgi should look like: \t</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">#!/usr/bin/ruby\n\n# Dreamhost clears environment variables when calling dispatch.fcgi, set again\nENV[&#39;RAILS_ENV&#39;] ||= &#39;production&#39;\nENV[&#39;HOME&#39;] ||= `echo ~`.strip\nENV[&#39;GEM_HOME&#39;] = File.expand_path(&#39;~/.gems&#39;)\nENV[&#39;GEM_PATH&#39;] = File.expand_path(&#39;~/.gems&#39;) + &quot;:&quot; + &#39;/usr/lib/ruby/gems/1.8&#39;\n\nrequire &#39;rubygems&#39;\nGem.clear_paths\nrequire &#39;fcgi&#39;\n\nrequire &#39;../your/app/config/boot.rb&#39;\nrequire &#39;../your/app/config/environment.rb&#39;\n\nclass Rack::PathInfoRewriter\n\tdef initialize(app)\n\t\t@app = app\n\tend\n\n\tdef call(env)\n\t\tenv.delete(&#39;SCRIPT_NAME&#39;)\n\t    parts = env[&#39;REQUEST_URI&#39;].split(&#39;?&#39;)\n\t    env[&#39;PATH_INFO&#39;] = parts[0]\n\t    env[&#39;QUERY_STRING&#39;] = parts[1].to_s\n\t    @app.call(env)\n\tend\nend\n\nRack::Handler::FastCGI.run\nRack::PathInfoRewriter.new(YourApp::Application)</code></pre></div>\n<p>Things to note about this file:</p>\n<ul>\n<li>The top of your file should point to the version of ruby you’re using. If you’re unsure where ruby is located, run <code class=\"language-text\">which ruby</code> in your ssh session.</li>\n<li>As noted on line 3: Dreamhost clears environment variables that Rails will need. You’ll need to set these according to your host credentials.</li>\n<li>Make sure that your required files are the correct paths.</li>\n<li>In the bottom line, replace <strong>YourApp</strong> with the name of your app.</li>\n</ul>\n<p>And now, your .htaccess:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\"> &lt;IfModule mod_fastcgi.c&gt;\n\tAddHandler fastcgi-script .fcgi\n&lt;/IfModule&gt;\n&lt;IfModule mod_fcgid.c&gt;\n\tAddHandler fcgid-script .fcgi\n&lt;/IfModule&gt;\n\nOptions +FollowSymLinks +ExecCGI\n\nRewriteEngine On\n\nRewriteCond %{REQUEST_FILENAME} !-f\nRewriteRule ^(.*)$ dispatch.fcgi/$1 [QSA,L]\n\nErrorDocument 500 &quot;Rails application failed to start properly&quot;</code></pre></div>\n<p>I didn’t make any changes to this configuration, it “just worked”.</p>\n<h3>Troubleshooting</h3>\n<p>You should be pretty much finished from here. If you open up the domain you installed to, it should either work or display “Rails application failed to start properly”. If you got the latter, no worries. You’re still ssh’d into your server, right? <code class=\"language-text\">cd</code> into <code class=\"language-text\">public/dispatch.fcgi</code> and type in terminal <code class=\"language-text\">ruby dispatch.fcgi</code>. That will run dispatch manually and tell you any errors encountered if there are any. More common issues are improper paths (for me, at least).</p>\n<h3>Pros</h3>\n<p>Dreamhost’s admin page. I’m biased here, but in all my time working with cPanel or other admin dashboards, I think that Dreamhost’s is the most user-friendly. It’s easy to set up users, domains, and databases. Ease of setup (kinda). Since Dreamhost manages servers for the most part, you don’t have to worry about apt-get apt-update linux stuff. I don’t know about you, but I’d rather focus on creating apps than being a sysadmin.</p>\n<h3>Cons</h3>\n<p>Documentation. Pretty terrible—written by customers of Dreamhost that detailed their experiences in getting apps running. I found more help on Redmine forums and StackOverflow. Fast CGI vs Passenger. Passenger would have been a lot easier to set up, but Dreamhost’s shared server version of Passenger hasn’t been updated since 2010. So using Fast CGI was a bit of a learning curve. Not the fastest solution.</p>\n<h2>Conclusion</h2>\n<p>Setting up Rails with Dreamhost was not as painful as I’d first thought. Seeing as the majority of my domains are registered at Dreamhost, it gives me a sort of OCD piece of mind knowing I can run my Rails apps alongside WordPress sites without worring about buying a VPS*. If you’re feeling extremely motivated, I bet you could write set up a remote git repository and set up a cron job that detects changes and autodeploys, something like a poor man’s Heroku. But that I leave up to you, dear reader.</p>\n<p><small>*For now. I will definitely need one down the road.</small></p>","frontmatter":{"title":"Configuring Rails projects with FastCGI for Dreamhost shared hosting","date":null}}},"pageContext":{"slug":"configuring-rails-projects-with-fastcgi-for-dreamhost-shared-hosting","blogpath":"blog/2014/configuring-rails-projects-with-fastcgi-for-dreamhost-shared-hosting","type":"blog","jekyllDate":"2014-07-01"}}