{"data":{"markdownRemark":{"html":"<p>This week I decided to dive into learning a frontend technology that’s been gaining serious traction in the Magento crowd: React and Progressive Web Apps (otherwise known as PWAs). <a href=\"https://www.gatsbyjs.org\">GatsbyJS</a> seemed like a great lower-barrier entry into both React and PWAs, with its fantastic documentation, strong community and abundant tutorials. I have previous experience in <a href=\"https://vuejs.org\">Vue</a> from building a larger Laravel application in my spare time, so picking up React has largely been a matter of learning syntax.</p>\n<p>To learn Gatsby, I decided to revamp my blog. It’s a prime candidate for this type of project: it’s already built on GitHub Pages using Jekyll, which means all pages are flat files. Gatsby also has a plugin for deploying to GitHub Pages, which means I can continue hosting there and not worry about finding a new host and updating DNS. I can continue writing in Markdown with the <a href=\"https://github.com/gatsbyjs/gatsby/tree/master/packages/gatsby-transformer-remark\">gatsby-transformer-remark</a> plugin, which parses markdown files.</p>\n<p>Below are some of my thoughts on the whole experience.</p>\n<h2>Gatsby</h2>\n<p>Gatsby is magic, pure and simple.</p>\n<h2>React</h2>\n<p>To be honest, I’m more a fan of Vue, though I admit it’s more a matter of familiarity at this point. Vue feels a bit more declarative, which I dig—it lets me build out complex reactive functionality without exposing the inner workings of how it’s handling things. In React land, having to explicitly bind values, write methods for handling changes and setting state is probably <em>safer</em>, but also a bit more boilerplate and annoying. That boilerplate does pay off when introducing Redux for state management, but I haven’t built a complex enough app to warrant needing a centralized state management library.</p>\n<h2>GraphQL</h2>\n<p>I didn’t get to heavy into GraphQL with this experiment. The most GraphQL on this blog are in <code class=\"language-text\">gatsby-node.js</code>. This file handles preprocessing and creating static files for all of the blog posts using the Remark markdown Gatsby plugin. But even that is easy to understand. The experience has largely been, “Ask for data in this shape, receive data in this same shape”.</p>\n<p>I did get tripped up a couple of times with having to explicitly ask for the correct data to return. That usually got cleared up pretty quickly when I ran the query in the GraphQL Playground that ships with Gatsby.</p>\n<p>I expect I’ll have more opinions on this once I get into pagination. Concepts like edges, cursors, and fragments will start to make sense in that context. Also, mutations are an unknown entity for me at the moment. So far I have only queried GraphQL data, never manipulated it.</p>\n<h2>Next week</h2>\n<p>I’m either going with …</p>\n<h3>Advanced React with Wes Bos</h3>\n<p>Learning React and GraphQL in more depth has been on my radar for some time. I purchased <a href=\"https://advancedreact.com/\">Wes Bos’s Advanced React</a> as soon as it was released, but have not fully completed it. In Advanced React, Wes uses the popular GraphQL client <a href=\"https://www.apollographql.com/\">Apollo</a> alongside Gatsby to create a fully-functional PWA storefront. It’s pretty clear that Magento is going all-in on GraphQL and React (which I consider a good thing for the most part), so I think it’s in my best interest to stay ahead of the curve by really grokking the concepts introduced in Wes’s Advanced React course.</p>\n<h3>Firebase</h3>\n<p>Firebase is a cool idea to me—billed as a “Backend as a Service”, Firebase is a decentralized data store by Google. I’m interested in creating a React app backed by Firebase and deploying it to GitHub Pages.</p>","frontmatter":{"title":"GatsbyJS and GitHub Pages","date":"2019-01-25"}}},"pageContext":{"slug":"gatsby-js-github-pages","blogpath":"journal/2019/gatsby-js-github-pages","type":"journal","jekyllDate":null}}